; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c4-s6-p14-a4)
(:domain logistics-strips)
(:objects a0 a1 a2 a3 
          c0 c1 c2 c3 
          t0 t1 t2 t3 
          l0-0 l0-1 l0-2 l0-3 l0-4 l0-5 l1-0 l1-1 l1-2 l1-3 l1-4 l1-5 l2-0 l2-1 l2-2 l2-3 l2-4 l2-5 l3-0 l3-1 l3-2 l3-3 l3-4 l3-5 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (AIRPLANE a2)
    (AIRPLANE a3)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l0-3)
    (in-city  l0-3 c0)
    (LOCATION l0-4)
    (in-city  l0-4 c0)
    (LOCATION l0-5)
    (in-city  l0-5 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l1-3)
    (in-city  l1-3 c1)
    (LOCATION l1-4)
    (in-city  l1-4 c1)
    (LOCATION l1-5)
    (in-city  l1-5 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (LOCATION l2-3)
    (in-city  l2-3 c2)
    (LOCATION l2-4)
    (in-city  l2-4 c2)
    (LOCATION l2-5)
    (in-city  l2-5 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (LOCATION l3-2)
    (in-city  l3-2 c3)
    (LOCATION l3-3)
    (in-city  l3-3 c3)
    (LOCATION l3-4)
    (in-city  l3-4 c3)
    (LOCATION l3-5)
    (in-city  l3-5 c3)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (OBJ p11)
    (OBJ p12)
    (OBJ p13)
    (at t0 l0-0)
    (at t1 l1-5)
    (at t2 l2-3)
    (at t3 l3-0)
    (at p0 l1-3)
    (at p1 l2-2)
    (at p2 l0-5)
    (at p3 l2-5)
    (at p4 l3-2)
    (at p5 l1-3)
    (at p6 l3-3)
    (at p7 l0-5)
    (at p8 l1-2)
    (at p9 l2-4)
    (at p10 l3-3)
    (at p11 l1-0)
    (at p12 l2-0)
    (at p13 l1-2)
    (at a0 l3-0)
    (at a1 l1-0)
    (at a2 l3-0)
    (at a3 l0-0)
)
(:goal
    (and
        (at p0 l1-4)
        (at p1 l0-4)
        (at p2 l3-2)
        (at p3 l2-0)
        (at p4 l0-0)
        (at p5 l3-1)
        (at p6 l0-0)
        (at p7 l0-1)
        (at p8 l3-4)
        (at p9 l0-2)
        (at p10 l0-0)
        (at p11 l0-5)
        (at p12 l0-1)
        (at p13 l0-4)
    )
)

  (:constraints
    (and
      (always (not (in p0 a0)))
      (always (not (in p0 a1)))
      (always (not (in p0 a2)))
      (always (not (in p0 a3)))
      (always (not (in p3 a0)))
      (always (not (in p3 a1)))
      (always (not (in p3 a2)))
      (always (not (in p3 a3)))
      (always (not (in p7 a0)))
      (always (not (in p7 a1)))
      (always (not (in p7 a2)))
      (always (not (in p7 a3)))
    )
  )
)

; plan
1. (fly-airplane a1 l1-0 l0-0)
   deleted: (at a1 l1-0)
   added: (at a1 l0-0)
   goals met: 0 of 14
2. (drive-truck t2 l2-3 l2-5 c2)
   deleted: (at t2 l2-3)
   added: (at t2 l2-5)
   goals met: 0 of 14
3. (drive-truck t1 l1-5 l1-4 c1)
   deleted: (at t1 l1-5)
   added: (at t1 l1-4)
   goals met: 0 of 14
4. (drive-truck t3 l3-0 l3-3 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-3)
   goals met: 0 of 14
5. (drive-truck t0 l0-0 l0-5 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-5)
   goals met: 0 of 14
6. (fly-airplane a2 l3-0 l2-0)
   deleted: (at a2 l3-0)
   added: (at a2 l2-0)
   goals met: 0 of 14
7. (fly-airplane a3 l0-0 l2-0)
   deleted: (at a3 l0-0)
   added: (at a3 l2-0)
   goals met: 0 of 14
8. (load-truck p3 t2 l2-5)
   deleted: (at p3 l2-5)
   added: (in p3 t2)
   goals met: 0 of 14
9. (load-truck p6 t3 l3-3)
   deleted: (at p6 l3-3)
   added: (in p6 t3)
   goals met: 0 of 14
10. (load-truck p10 t3 l3-3)
   deleted: (at p10 l3-3)
   added: (in p10 t3)
   goals met: 0 of 14
11. (load-truck p7 t0 l0-5)
   deleted: (at p7 l0-5)
   added: (in p7 t0)
   goals met: 0 of 14
12. (load-truck p2 t0 l0-5)
   deleted: (at p2 l0-5)
   added: (in p2 t0)
   goals met: 0 of 14
13. (drive-truck t1 l1-4 l1-3 c1)
   deleted: (at t1 l1-4)
   added: (at t1 l1-3)
   goals met: 0 of 14
14. (load-airplane p12 a2 l2-0)
   deleted: (at p12 l2-0)
   added: (in p12 a2)
   goals met: 0 of 14
15. (fly-airplane a3 l2-0 l3-0)
   deleted: (at a3 l2-0)
   added: (at a3 l3-0)
   goals met: 0 of 14
16. (drive-truck t2 l2-5 l2-4 c2)
   deleted: (at t2 l2-5)
   added: (at t2 l2-4)
   goals met: 0 of 14
17. (drive-truck t3 l3-3 l3-4 c3)
   deleted: (at t3 l3-3)
   added: (at t3 l3-4)
   goals met: 0 of 14
18. (load-truck p5 t1 l1-3)
   deleted: (at p5 l1-3)
   added: (in p5 t1)
   goals met: 0 of 14
19. (load-truck p0 t1 l1-3)
   deleted: (at p0 l1-3)
   added: (in p0 t1)
   goals met: 0 of 14
20. (drive-truck t0 l0-5 l0-1 c0)
   deleted: (at t0 l0-5)
   added: (at t0 l0-1)
   goals met: 0 of 14
21. (fly-airplane a3 l3-0 l1-0)
   deleted: (at a3 l3-0)
   added: (at a3 l1-0)
   goals met: 0 of 14
22. (load-truck p9 t2 l2-4)
   deleted: (at p9 l2-4)
   added: (in p9 t2)
   goals met: 0 of 14
23. (drive-truck t1 l1-3 l1-4 c1)
   deleted: (at t1 l1-3)
   added: (at t1 l1-4)
   goals met: 0 of 14
24. (unload-truck p7 t0 l0-1)
   deleted: (in p7 t0)
   added: (at p7 l0-1)
   goals met: 1 of 14
25. (drive-truck t3 l3-4 l3-2 c3)
   deleted: (at t3 l3-4)
   added: (at t3 l3-2)
   goals met: 1 of 14
26. (load-airplane p11 a3 l1-0)
   deleted: (at p11 l1-0)
   added: (in p11 a3)
   goals met: 1 of 14
27. (drive-truck t2 l2-4 l2-2 c2)
   deleted: (at t2 l2-4)
   added: (at t2 l2-2)
   goals met: 1 of 14
28. (unload-truck p0 t1 l1-4)
   deleted: (in p0 t1)
   added: (at p0 l1-4)
   goals met: 2 of 14
29. (load-truck p4 t3 l3-2)
   deleted: (at p4 l3-2)
   added: (in p4 t3)
   goals met: 2 of 14
30. (drive-truck t0 l0-1 l0-0 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 2 of 14
31. (load-truck p1 t2 l2-2)
   deleted: (at p1 l2-2)
   added: (in p1 t2)
   goals met: 2 of 14
32. (drive-truck t1 l1-4 l1-2 c1)
   deleted: (at t1 l1-4)
   added: (at t1 l1-2)
   goals met: 2 of 14
33. (unload-truck p2 t0 l0-0)
   deleted: (in p2 t0)
   added: (at p2 l0-0)
   goals met: 2 of 14
34. (drive-truck t3 l3-2 l3-0 c3)
   deleted: (at t3 l3-2)
   added: (at t3 l3-0)
   goals met: 2 of 14
35. (drive-truck t2 l2-2 l2-0 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-0)
   goals met: 2 of 14
36. (load-truck p8 t1 l1-2)
   deleted: (at p8 l1-2)
   added: (in p8 t1)
   goals met: 2 of 14
37. (load-truck p13 t1 l1-2)
   deleted: (at p13 l1-2)
   added: (in p13 t1)
   goals met: 2 of 14
38. (unload-truck p6 t3 l3-0)
   deleted: (in p6 t3)
   added: (at p6 l3-0)
   goals met: 2 of 14
39. (unload-truck p4 t3 l3-0)
   deleted: (in p4 t3)
   added: (at p4 l3-0)
   goals met: 2 of 14
40. (unload-truck p10 t3 l3-0)
   deleted: (in p10 t3)
   added: (at p10 l3-0)
   goals met: 2 of 14
41. (load-airplane p2 a1 l0-0)
   deleted: (at p2 l0-0)
   added: (in p2 a1)
   goals met: 2 of 14
42. (unload-truck p9 t2 l2-0)
   deleted: (in p9 t2)
   added: (at p9 l2-0)
   goals met: 2 of 14
43. (unload-truck p3 t2 l2-0)
   deleted: (in p3 t2)
   added: (at p3 l2-0)
   goals met: 3 of 14
44. (unload-truck p1 t2 l2-0)
   deleted: (in p1 t2)
   added: (at p1 l2-0)
   goals met: 3 of 14
45. (drive-truck t1 l1-2 l1-0 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-0)
   goals met: 3 of 14
46. (load-airplane p6 a0 l3-0)
   deleted: (at p6 l3-0)
   added: (in p6 a0)
   goals met: 3 of 14
47. (load-airplane p4 a0 l3-0)
   deleted: (at p4 l3-0)
   added: (in p4 a0)
   goals met: 3 of 14
48. (load-airplane p10 a0 l3-0)
   deleted: (at p10 l3-0)
   added: (in p10 a0)
   goals met: 3 of 14
49. (fly-airplane a1 l0-0 l3-0)
   deleted: (at a1 l0-0)
   added: (at a1 l3-0)
   goals met: 3 of 14
50. (unload-truck p8 t1 l1-0)
   deleted: (in p8 t1)
   added: (at p8 l1-0)
   goals met: 3 of 14
51. (unload-truck p5 t1 l1-0)
   deleted: (in p5 t1)
   added: (at p5 l1-0)
   goals met: 3 of 14
52. (unload-truck p13 t1 l1-0)
   deleted: (in p13 t1)
   added: (at p13 l1-0)
   goals met: 3 of 14
53. (fly-airplane a0 l3-0 l0-0)
   deleted: (at a0 l3-0)
   added: (at a0 l0-0)
   goals met: 3 of 14
54. (unload-airplane p2 a1 l3-0)
   deleted: (in p2 a1)
   added: (at p2 l3-0)
   goals met: 3 of 14
55. (load-airplane p9 a2 l2-0)
   deleted: (at p9 l2-0)
   added: (in p9 a2)
   goals met: 3 of 14
56. (load-airplane p1 a2 l2-0)
   deleted: (at p1 l2-0)
   added: (in p1 a2)
   goals met: 3 of 14
57. (unload-airplane p6 a0 l0-0)
   deleted: (in p6 a0)
   added: (at p6 l0-0)
   goals met: 4 of 14
58. (unload-airplane p4 a0 l0-0)
   deleted: (in p4 a0)
   added: (at p4 l0-0)
   goals met: 5 of 14
59. (unload-airplane p10 a0 l0-0)
   deleted: (in p10 a0)
   added: (at p10 l0-0)
   goals met: 6 of 14
60. (load-truck p2 t3 l3-0)
   deleted: (at p2 l3-0)
   added: (in p2 t3)
   goals met: 6 of 14
61. (fly-airplane a2 l2-0 l0-0)
   deleted: (at a2 l2-0)
   added: (at a2 l0-0)
   goals met: 6 of 14
62. (load-airplane p8 a3 l1-0)
   deleted: (at p8 l1-0)
   added: (in p8 a3)
   goals met: 6 of 14
63. (load-airplane p5 a3 l1-0)
   deleted: (at p5 l1-0)
   added: (in p5 a3)
   goals met: 6 of 14
64. (load-airplane p13 a3 l1-0)
   deleted: (at p13 l1-0)
   added: (in p13 a3)
   goals met: 6 of 14
65. (drive-truck t3 l3-0 l3-2 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-2)
   goals met: 6 of 14
66. (unload-airplane p9 a2 l0-0)
   deleted: (in p9 a2)
   added: (at p9 l0-0)
   goals met: 6 of 14
67. (unload-airplane p12 a2 l0-0)
   deleted: (in p12 a2)
   added: (at p12 l0-0)
   goals met: 6 of 14
68. (unload-airplane p1 a2 l0-0)
   deleted: (in p1 a2)
   added: (at p1 l0-0)
   goals met: 6 of 14
69. (fly-airplane a3 l1-0 l3-0)
   deleted: (at a3 l1-0)
   added: (at a3 l3-0)
   goals met: 6 of 14
70. (unload-truck p2 t3 l3-2)
   deleted: (in p2 t3)
   added: (at p2 l3-2)
   goals met: 7 of 14
71. (load-truck p9 t0 l0-0)
   deleted: (at p9 l0-0)
   added: (in p9 t0)
   goals met: 7 of 14
72. (load-truck p12 t0 l0-0)
   deleted: (at p12 l0-0)
   added: (in p12 t0)
   goals met: 7 of 14
73. (load-truck p1 t0 l0-0)
   deleted: (at p1 l0-0)
   added: (in p1 t0)
   goals met: 7 of 14
74. (unload-airplane p8 a3 l3-0)
   deleted: (in p8 a3)
   added: (at p8 l3-0)
   goals met: 7 of 14
75. (unload-airplane p5 a3 l3-0)
   deleted: (in p5 a3)
   added: (at p5 l3-0)
   goals met: 7 of 14
76. (drive-truck t3 l3-2 l3-4 c3)
   deleted: (at t3 l3-2)
   added: (at t3 l3-4)
   goals met: 7 of 14
77. (fly-airplane a3 l3-0 l0-0)
   deleted: (at a3 l3-0)
   added: (at a3 l0-0)
   goals met: 7 of 14
78. (unload-airplane p13 a3 l0-0)
   deleted: (in p13 a3)
   added: (at p13 l0-0)
   goals met: 7 of 14
79. (unload-airplane p11 a3 l0-0)
   deleted: (in p11 a3)
   added: (at p11 l0-0)
   goals met: 7 of 14
80. (drive-truck t3 l3-4 l3-0 c3)
   deleted: (at t3 l3-4)
   added: (at t3 l3-0)
   goals met: 7 of 14
81. (load-truck p13 t0 l0-0)
   deleted: (at p13 l0-0)
   added: (in p13 t0)
   goals met: 7 of 14
82. (load-truck p11 t0 l0-0)
   deleted: (at p11 l0-0)
   added: (in p11 t0)
   goals met: 7 of 14
83. (load-truck p8 t3 l3-0)
   deleted: (at p8 l3-0)
   added: (in p8 t3)
   goals met: 7 of 14
84. (load-truck p5 t3 l3-0)
   deleted: (at p5 l3-0)
   added: (in p5 t3)
   goals met: 7 of 14
85. (drive-truck t0 l0-0 l0-5 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-5)
   goals met: 7 of 14
86. (drive-truck t3 l3-0 l3-4 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-4)
   goals met: 7 of 14
87. (unload-truck p11 t0 l0-5)
   deleted: (in p11 t0)
   added: (at p11 l0-5)
   goals met: 8 of 14
88. (unload-truck p8 t3 l3-4)
   deleted: (in p8 t3)
   added: (at p8 l3-4)
   goals met: 9 of 14
89. (drive-truck t0 l0-5 l0-4 c0)
   deleted: (at t0 l0-5)
   added: (at t0 l0-4)
   goals met: 9 of 14
90. (drive-truck t3 l3-4 l3-1 c3)
   deleted: (at t3 l3-4)
   added: (at t3 l3-1)
   goals met: 9 of 14
91. (unload-truck p13 t0 l0-4)
   deleted: (in p13 t0)
   added: (at p13 l0-4)
   goals met: 10 of 14
92. (unload-truck p1 t0 l0-4)
   deleted: (in p1 t0)
   added: (at p1 l0-4)
   goals met: 11 of 14
93. (unload-truck p5 t3 l3-1)
   deleted: (in p5 t3)
   added: (at p5 l3-1)
   goals met: 12 of 14
94. (drive-truck t0 l0-4 l0-2 c0)
   deleted: (at t0 l0-4)
   added: (at t0 l0-2)
   goals met: 12 of 14
95. (unload-truck p9 t0 l0-2)
   deleted: (in p9 t0)
   added: (at p9 l0-2)
   goals met: 13 of 14
96. (drive-truck t0 l0-2 l0-1 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-1)
   goals met: 13 of 14
97. (unload-truck p12 t0 l0-1)
   deleted: (in p12 t0)
   added: (at p12 l0-1)
   goals met: 14 of 14
